RickFBAG/esp32-s3-knob-touch-lcd-1.8-lvgl-thermostat/src/lcd_bsp.c
  for (int x = 0; x < EXAMPLE_LCD_H_RES; x++) {
    line_buf[x] = color565;
  }

  for (int y = 0; y < EXAMPLE_LCD_V_RES; y++) {
    esp_lcd_panel_draw_bitmap(panel_handle, 0, y, EXAMPLE_LCD_H_RES, y + 1, line_buf);
    // tx_param blocks until pending tx_color queue is drained; keeps line_buf reuse safe.
    esp_lcd_panel_io_tx_param(amoled_panel_io_handle, LCD_CMD_NOP, NULL, 0);
  }
}

static void panel_known_good_render_test(esp_lcd_panel_handle_t panel_handle)
{
#if LCD_RUN_PANEL_SOLID_COLOR_TEST
  DBG_PRINTF("[DBG] panel: solid color test start\r\n");
  static const uint16_t colors[] = {0xF800, 0x07E0, 0x001F, 0xFFFF, 0x0000};
  static const char *names[] = {"RED", "GREEN", "BLUE", "WHITE", "BLACK"};
  const int count = sizeof(colors) / sizeof(colors[0]);

  for (int i = 0; i < count; i++) {
    ESP_LOGI(TAG, "Panel solid test color: %s", names[i]);
    DBG_PRINTF("[DBG] panel: fill %s\r\n", names[i]);
    panel_fill_solid_color(panel_handle, colors[i]);
    vTaskDelay(pdMS_TO_TICKS(LCD_PANEL_TEST_COLOR_HOLD_MS));
  }
  DBG_PRINTF("[DBG] panel: solid color test done\r\n");

#if !LCD_START_LV_DEMO_WIDGETS
  // Keep a visible end-state when demo is disabled.
  DBG_PRINTF("[DBG] panel: hold WHITE (demo disabled)\r\n");
  panel_fill_solid_color(panel_handle, 0xFFFF);
#endif
#else
  (void)panel_handle;
#endif
}

static void create_fallback_ui(void)
{
  lv_obj_t *scr = lv_scr_act();
  lv_obj_set_style_bg_color(scr, lv_color_hex(0x0D1B2A), 0);
  lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);

  lv_obj_t *label = lv_label_create(scr);
  lv_label_set_text(label, "ESP32-S3 Knob Touch\nUI fallback actief");
  lv_obj_set_style_text_color(label, lv_color_hex(0xE0E1DD), 0);
  lv_obj_set_style_text_align(label, LV_TEXT_ALIGN_CENTER, 0);
  lv_obj_center(label);
}

static void encoder_init(void)
{
#if LCD_USE_ROTARY_ENCODER
  const gpio_config_t cfg = {
      .pin_bit_mask = (1ULL << LCD_ENCODER_PIN_A) | (1ULL << LCD_ENCODER_PIN_B),
      .mode = GPIO_MODE_INPUT,
      .pull_up_en = GPIO_PULLUP_ENABLE,
      .pull_down_en = GPIO_PULLDOWN_DISABLE,
      .intr_type = GPIO_INTR_DISABLE,
  };
  if (gpio_config(&cfg) != ESP_OK) {
    ESP_LOGW(TAG, "Failed to init rotary GPIO");
    return;
  }
  const uint8_t a = (uint8_t)gpio_get_level((gpio_num_t)LCD_ENCODER_PIN_A);
  const uint8_t b = (uint8_t)gpio_get_level((gpio_num_t)LCD_ENCODER_PIN_B);
  s_encoder_prev_state = (uint8_t)((a << 1) | b);
  s_encoder_step_accum = 0;
  s_encoder_last_poll_ms = 0;
  s_encoder_ui_missing_logged = false;
  ENCODER_LOGI("ENC init: pinA=%d pinB=%d state=%u steps=%d invert=%d poll=%dms altPins=%d",
               LCD_ENCODER_PIN_A, LCD_ENCODER_PIN_B, s_encoder_prev_state,
               LCD_ENCODER_STEPS_PER_DETENT, LCD_ENCODER_INVERT_DIRECTION,
               LCD_ENCODER_POLL_INTERVAL_MS, LCD_ENCODER_USE_ALT_PINSET);
#endif
}

static void encoder_poll_update_ui(void)
{
#if LCD_USE_ROTARY_ENCODER
  // Gray-code transition table for quadrature encoder.
  static const int8_t qdec[16] = {0, -1, 1, 0, 1, 0, 0, -1, -1, 0, 0, 1, 0, 1, -1, 0};
  if (ui_ArcDoel == NULL || !lv_obj_is_valid(ui_ArcDoel) || lv_obj_get_screen(ui_ArcDoel) != lv_scr_act()) {
    if (!s_encoder_ui_missing_logged) {
      ENCODER_LOGI("ENC ui not ready/active: arc=%p valid=%d on_active_screen=%d",
                   (void *)ui_ArcDoel,
                   (ui_ArcDoel != NULL) ? lv_obj_is_valid(ui_ArcDoel) : 0,
                   (ui_ArcDoel != NULL && lv_obj_is_valid(ui_ArcDoel) && lv_obj_get_screen(ui_ArcDoel) == lv_scr_act()) ? 1 : 0);
      s_encoder_ui_missing_logged = true;
    }
    return;
  }
  s_encoder_ui_missing_logged = false;

  const uint8_t a = (uint8_t)gpio_get_level((gpio_num_t)LCD_ENCODER_PIN_A);
  const uint8_t b = (uint8_t)gpio_get_level((gpio_num_t)LCD_ENCODER_PIN_B);
  const uint8_t state = (uint8_t)((a << 1) | b);
  const uint8_t idx = (uint8_t)((s_encoder_prev_state << 2) | state);
  int8_t delta = qdec[idx];
  const uint8_t prev_state = s_encoder_prev_state;
  s_encoder_prev_state = state;
  if (state != prev_state || delta != 0) {
    ENCODER_LOGI("ENC raw: A=%u B=%u prev=%u state=%u idx=0x%02X delta=%d",
                 a, b, prev_state, state, idx, delta);
  }
#if LCD_ENCODER_INVERT_DIRECTION
  delta = (int8_t)(-delta);
#endif
  if (delta == 0) {
    return;
  }
  s_encoder_step_accum += delta;
  ENCODER_LOGI("ENC accum: delta=%d accum=%d", delta, s_encoder_step_accum);

  while (s_encoder_step_accum >= LCD_ENCODER_STEPS_PER_DETENT || s_encoder_step_accum <= -LCD_ENCODER_STEPS_PER_DETENT) {
    const int detent = (s_encoder_step_accum > 0) ? 1 : -1;
    s_encoder_step_accum -= (int8_t)(detent * LCD_ENCODER_STEPS_PER_DETENT);

    int value = lv_arc_get_value(ui_ArcDoel);
    const int min = lv_arc_get_min_value(ui_ArcDoel);
    const int max = lv_arc_get_max_value(ui_ArcDoel);
    const int old_value = value;
    value += detent;
    if (value < min) value = min;
    if (value > max) value = max;
    lv_arc_set_value(ui_ArcDoel, value);
    ENCODER_LOGI("ENC detent: detent=%d old=%d new=%d min=%d max=%d accum_rem=%d",
                 detent, old_value, value, min, max, s_encoder_step_accum);

    // Keep thermostat labels synced with the target arc value.
    if (ui_Temp) {
      char buf[8];
      lv_snprintf(buf, sizeof(buf), "%d", value);
      lv_label_set_text(ui_Temp, buf);
    }
    if (ui_Temperature1) {
      char buf[8];
      lv_snprintf(buf, sizeof(buf), "%d", value);
      lv_label_set_text(ui_Temperature1, buf);
    }
    ENCODER_LOGI("ENC write: arc=%d temp=%d", value, value);
  }
#endif
}

void lcd_lvgl_Init(void)
{
  static lv_disp_draw_buf_t disp_buf; // contains internal graphic buffer(s) called draw buffer(s)
  static lv_disp_drv_t disp_drv;      // contains callback functions

  s_lvgl_flush_ready_enabled = false;
  DBG_PRINTF("[DBG] lcd_lvgl_Init: enter\r\n");
  ESP_LOGI(TAG, "LCD config: mode=%s color_order=%s pclk=%dMHz flush=%s qspi_cmd=%s qspi_cmd_bits=%d qspi_octal=%d dc_as_cmd=%d init=%s",
           LCD_USE_QSPI ? "QSPI" : "SPI",
           LCD_COLOR_ORDER_BGR ? "BGR" : "RGB",
           LCD_QSPI_PCLK_40MHZ ? 40 : (LCD_QSPI_PCLK_10MHZ ? 10 : 20),
           LCD_LVGL_ASYNC_FLUSH ? "ASYNC_CB" : "SYNC",
           LCD_QSPI_CMD_PACKING_ALT ? "ALT" : "DEFAULT",
           LCD_QSPI_CMD_BITS_8 ? 8 : 32,
           LCD_QSPI_OCTAL_MODE ? 1 : 0,
           LCD_DC_AS_CMD_PHASE ? 1 : 0,
           LCD_USE_CUSTOM_INIT_CMDS ? "CUSTOM" : "DRIVER_DEFAULT");

  const spi_bus_config_t buscfg =
#if LCD_USE_QSPI
      SH8601_PANEL_BUS_QSPI_CONFIG(EXAMPLE_PIN_NUM_LCD_PCLK,
                                   EXAMPLE_PIN_NUM_LCD_DATA0,
                                   EXAMPLE_PIN_NUM_LCD_DATA1,
                                   EXAMPLE_PIN_NUM_LCD_DATA2,
                                   EXAMPLE_PIN_NUM_LCD_DATA3,
                                   EXAMPLE_LCD_H_RES * EXAMPLE_LCD_V_RES * LCD_BIT_PER_PIXEL / 8);
#else
      SH8601_PANEL_BUS_SPI_CONFIG(EXAMPLE_PIN_NUM_LCD_PCLK,
                                  EXAMPLE_PIN_NUM_LCD_DATA0,
                                  EXAMPLE_LCD_H_RES * EXAMPLE_LCD_V_RES * LCD_BIT_PER_PIXEL / 8);
#endif
  ESP_ERROR_CHECK_WITHOUT_ABORT(spi_bus_initialize(LCD_HOST, &buscfg, SPI_DMA_CH_AUTO));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: spi_bus_initialize done\r\n");
  esp_lcd_panel_io_handle_t io_handle = NULL;

  const esp_lcd_panel_io_spi_config_t io_config =
#if LCD_USE_QSPI
      SH8601_PANEL_IO_QSPI_CONFIG(EXAMPLE_PIN_NUM_LCD_CS,
#if LCD_LVGL_ASYNC_FLUSH
                                  example_notify_lvgl_flush_ready,
                                  &disp_drv);
#else
                                  NULL,
                                  NULL);
#endif
#else
      SH8601_PANEL_IO_SPI_CONFIG(EXAMPLE_PIN_NUM_LCD_CS,
                                 EXAMPLE_PIN_NUM_LCD_DC,
#if LCD_LVGL_ASYNC_FLUSH
                                 example_notify_lvgl_flush_ready,
                                 &disp_drv);
#else
                                 NULL,
                                 NULL);
#endif
#endif

  sh8601_vendor_config_t vendor_config = 
  {
    .init_cmds = LCD_USE_CUSTOM_INIT_CMDS ? lcd_init_cmds : NULL,
    .init_cmds_size = LCD_USE_CUSTOM_INIT_CMDS ? (sizeof(lcd_init_cmds) / sizeof(lcd_init_cmds[0])) : 0,
    .flags = 
    {
      .use_qspi_interface = LCD_USE_QSPI,
    },
  };
  ESP_ERROR_CHECK_WITHOUT_ABORT(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_HOST, &io_config, &io_handle));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: panel_io created\r\n");
  amoled_panel_io_handle = io_handle;
  esp_lcd_panel_handle_t panel_handle = NULL;
  const esp_lcd_panel_dev_config_t panel_config = 
  {
    .reset_gpio_num = EXAMPLE_PIN_NUM_LCD_RST,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    .rgb_ele_order = LCD_COLOR_ORDER_BGR ? LCD_RGB_ELEMENT_ORDER_BGR : LCD_RGB_ELEMENT_ORDER_RGB,
#else
    .color_space = LCD_COLOR_ORDER_BGR ? ESP_LCD_COLOR_SPACE_BGR : ESP_LCD_COLOR_SPACE_RGB,
#endif
    .bits_per_pixel = LCD_BIT_PER_PIXEL,
    .vendor_config = &vendor_config,
  };
  ESP_ERROR_CHECK_WITHOUT_ABORT(esp_lcd_new_panel_sh8601(io_handle, &panel_config, &panel_handle));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: sh8601 panel created\r\n");
  ESP_ERROR_CHECK_WITHOUT_ABORT(esp_lcd_panel_reset(panel_handle));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: panel reset done\r\n");
  ESP_ERROR_CHECK_WITHOUT_ABORT(esp_lcd_panel_init(panel_handle));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: panel init done\r\n");
#if LCD_EXPLICIT_DISP_ON
  ESP_ERROR_CHECK_WITHOUT_ABORT(esp_lcd_panel_disp_on_off(panel_handle, true));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: panel display ON\r\n");
#else
  DBG_PRINTF("[DBG] lcd_lvgl_Init: panel display ON skipped (LCD_EXPLICIT_DISP_ON=0)\r\n");
#endif
  panel_known_good_render_test(panel_handle);
  DBG_PRINTF("[DBG] lcd_lvgl_Init: panel color test returned\r\n");

  lv_init();
  lv_color_t *buf1 = heap_caps_malloc(EXAMPLE_LCD_H_RES * EXAMPLE_LVGL_BUF_HEIGHT * sizeof(lv_color_t), MALLOC_CAP_DMA);
  if (!buf1) {
    ESP_LOGE(TAG, "Failed to allocate LVGL buf1");
    return;
  }
  lv_color_t *buf2 = heap_caps_malloc(EXAMPLE_LCD_H_RES * EXAMPLE_LVGL_BUF_HEIGHT * sizeof(lv_color_t), MALLOC_CAP_DMA);
  if (!buf2) {
    ESP_LOGW(TAG, "LVGL buf2 allocation failed, falling back to single buffer");
  }
  lv_disp_draw_buf_init(&disp_buf, buf1, buf2, EXAMPLE_LCD_H_RES * EXAMPLE_LVGL_BUF_HEIGHT);
  lv_disp_drv_init(&disp_drv);
  disp_drv.hor_res = EXAMPLE_LCD_H_RES;
  disp_drv.ver_res = EXAMPLE_LCD_V_RES;
  disp_drv.flush_cb = example_lvgl_flush_cb;
  disp_drv.rounder_cb = example_lvgl_rounder_cb;
  disp_drv.draw_buf = &disp_buf;
  disp_drv.user_data = panel_handle;
  lv_disp_t *disp = lv_disp_drv_register(&disp_drv);
  s_lvgl_flush_ready_enabled = true;
  DBG_PRINTF("[DBG] lcd_lvgl_Init: lvgl display driver registered\r\n");

  static lv_indev_drv_t indev_drv;    // Input device driver (Touch)
  lv_indev_drv_init(&indev_drv);
  indev_drv.type = LV_INDEV_TYPE_POINTER;
  indev_drv.disp = disp;
  indev_drv.read_cb = example_lvgl_touch_cb;
  lv_indev_drv_register(&indev_drv);
  DBG_PRINTF("[DBG] lcd_lvgl_Init: touch indev registered\r\n");

  const esp_timer_create_args_t lvgl_tick_timer_args = 
  {
    .callback = &example_increase_lvgl_tick,
    .name = "lvgl_tick"
  };
  esp_timer_handle_t lvgl_tick_timer = NULL;
  ESP_ERROR_CHECK(esp_timer_create(&lvgl_tick_timer_args, &lvgl_tick_timer));
  ESP_ERROR_CHECK(esp_timer_start_periodic(lvgl_tick_timer, EXAMPLE_LVGL_TICK_PERIOD_MS * 1000));
  DBG_PRINTF("[DBG] lcd_lvgl_Init: tick timer started\r\n");

  lvgl_mux = xSemaphoreCreateMutex(); //mutex semaphores
  assert(lvgl_mux);
  encoder_init();
  xTaskCreate(example_lvgl_port_task, "LVGL", EXAMPLE_LVGL_TASK_STACK_SIZE, NULL, EXAMPLE_LVGL_TASK_PRIORITY, NULL);
  DBG_PRINTF("[DBG] lcd_lvgl_Init: lvgl task created\r\n");
  if (example_lvgl_lock(-1)) 
  {   
#if LCD_START_LV_DEMO_WIDGETS
    DBG_PRINTF("[DBG] lcd_lvgl_Init: starting lv_demo_widgets\r\n");
    lv_demo_widgets();      /* A widgets example */
    DBG_PRINTF("[DBG] lcd_lvgl_Init: lv_demo_widgets started\r\n");
#else
    if (ui_init) {
      DBG_PRINTF("[DBG] lcd_lvgl_Init: starting ui_init\r\n");
      ui_init();
      DBG_PRINTF("[DBG] lcd_lvgl_Init: ui_init done\r\n");
    } else {
      DBG_PRINTF("[DBG] lcd_lvgl_Init: ui_init missing, fallback UI\r\n");
      create_fallback_ui();
    }
#endif
    //lv_demo_music();        /* A modern, smartphone-like music player demo. */
    //lv_demo_stress();       /* A stress test for LVGL. */
    //lv_demo_benchmark();    /* A demo to measure the performance of LVGL or to compare different settings. */

    // Release the mutex
    example_lvgl_unlock();
  }
  DBG_PRINTF("[DBG] lcd_lvgl_Init: exit\r\n");
}

