RickFBAG/esp32-s3-knob-touch-lcd-1.8-lvgl-thermostat/src/lcd_bsp.c
static bool example_lvgl_lock(int timeout_ms)
{
  assert(lvgl_mux && "bsp_display_start must be called first");

  const TickType_t timeout_ticks = (timeout_ms == -1) ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);
  return xSemaphoreTake(lvgl_mux, timeout_ticks) == pdTRUE;
}

static void example_lvgl_unlock(void)
{
  assert(lvgl_mux && "bsp_display_start must be called first");
  xSemaphoreGive(lvgl_mux);
}
static void example_lvgl_port_task(void *arg)
{
  uint32_t task_delay_ms = EXAMPLE_LVGL_TASK_MAX_DELAY_MS;
  const uint32_t encoder_poll_interval_ms = (LCD_ENCODER_POLL_INTERVAL_MS > 0) ? LCD_ENCODER_POLL_INTERVAL_MS : 1;
  for(;;)
  {
    if (example_lvgl_lock(-1))
    {
      const uint32_t now_ms = (uint32_t)(xTaskGetTickCount() * portTICK_PERIOD_MS);
      if ((now_ms - s_encoder_last_poll_ms) >= encoder_poll_interval_ms) {
        s_encoder_last_poll_ms = now_ms;
        encoder_poll_update_ui();
      }
      task_delay_ms = lv_timer_handler();
      
      example_lvgl_unlock();
    }
    if (task_delay_ms > EXAMPLE_LVGL_TASK_MAX_DELAY_MS)
    {
      task_delay_ms = EXAMPLE_LVGL_TASK_MAX_DELAY_MS;
    }
    else if (task_delay_ms < EXAMPLE_LVGL_TASK_MIN_DELAY_MS)
    {
      task_delay_ms = EXAMPLE_LVGL_TASK_MIN_DELAY_MS;
    }
#if LCD_USE_ROTARY_ENCODER
    if (task_delay_ms > encoder_poll_interval_ms) {
      task_delay_ms = encoder_poll_interval_ms;
    }
#endif
    vTaskDelay(pdMS_TO_TICKS(task_delay_ms));
  }
}
static void example_increase_lvgl_tick(void *arg)
{
  lv_tick_inc(EXAMPLE_LVGL_TICK_PERIOD_MS);
}
static bool example_notify_lvgl_flush_ready(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx)
{
  (void)panel_io;
  (void)edata;
#if LCD_LVGL_ASYNC_FLUSH
  if (!s_lvgl_flush_ready_enabled || user_ctx == NULL) {
    return false;
  }
  lv_disp_drv_t *disp_driver = (lv_disp_drv_t *)user_ctx;
  if (disp_driver->draw_buf == NULL) {
    return false;
  }
  lv_disp_flush_ready(disp_driver);
#else
  (void)user_ctx;
#endif
  return false;
}
static void example_lvgl_flush_cb(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_map)
{
  esp_lcd_panel_handle_t panel_handle = (esp_lcd_panel_handle_t) drv->user_data;
  const int offsetx1 = area->x1;
  const int offsetx2 = area->x2;
  const int offsety1 = area->y1;
  const int offsety2 = area->y2;

  esp_lcd_panel_draw_bitmap(panel_handle, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1, color_map);
#if !LCD_LVGL_ASYNC_FLUSH
  lv_disp_flush_ready(drv);
#else
  (void)drv;
#endif
}
void example_lvgl_rounder_cb(struct _lv_disp_drv_t *disp_drv, lv_area_t *area)
{
  uint16_t x1 = area->x1;
  uint16_t x2 = area->x2;

  uint16_t y1 = area->y1;
  uint16_t y2 = area->y2;

  // round the start of coordinate down to the nearest 2M number
  area->x1 = (x1 >> 1) << 1;
  area->y1 = (y1 >> 1) << 1;
  // round the end of coordinate up to the nearest 2N+1 number
  area->x2 = ((x2 >> 1) << 1) + 1;
  area->y2 = ((y2 >> 1) << 1) + 1;
}
static void example_lvgl_touch_cb(lv_indev_drv_t *drv, lv_indev_data_t *data)
{
  uint16_t tp_x,tp_y;
  uint8_t win = getTouch(&tp_x,&tp_y);
  if (win)
  {
    #ifdef EXAMPLE_Rotate_90
      data->point.x = tp_y;
      data->point.y = (EXAMPLE_LCD_V_RES - tp_x);
    #else
      data->point.x = tp_x;
      data->point.y = tp_y;
    #endif
    if(data->point.x > EXAMPLE_LCD_H_RES)
    data->point.x = EXAMPLE_LCD_H_RES;
    if(data->point.y > EXAMPLE_LCD_V_RES)
    data->point.y = EXAMPLE_LCD_V_RES;
    data->state = LV_INDEV_STATE_PRESSED;
    //ESP_LOGE("TP","(%d,%d)",data->point.x,data->point.y);
  }
  else
  {
    data->state = LV_INDEV_STATE_RELEASED;
  }
}
